app/controllers/school_classes_controller.rb

    def create
      # raise params.inspect
      @school_class = SchoolClass.create post_params(:title, :room_number)
---
INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Software Engineering"], ["room_number", 10], ["created_at", "2019-06-30 23:27:46.894365"], ["updated_at", "2019-06-30 23:27:46.894365"]]

    def update
      set_school_class
      @school_class.update post_params(:title)
---
UPDATE "school_classes" SET "title" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["title", "Risk Analysis"], ["updated_at", "2019-06-30 23:27:46.960999"], ["id", 1]]

    def set_school_class
      @school_class = SchoolClass.find params[:id]
---
SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT 1  [["id", 1]]